In [1]:
import pandas as pd
import numpy as np

## creating dataframe work using list, dictionary, array and series

In [5]:
data = {
    "StudentName": ["Yash", "Anagha", "Arpit", "Kunal", "Manish"],
    "StudentAge": [20,20,21,22,25]
}

In [6]:
data

{'StudentName': ['Yash', 'Anagha', 'Arpit', 'Kunal', 'Manish'],
 'StudentAge': [20, 20, 21, 22, 25]}

In [13]:
data["StudentName"][1]
data["StudentAge"][1]

20

In [14]:
data["Marks"] = [80,85,90,50,60]

In [16]:
print(data)

{'StudentName': ['Yash', 'Anagha', 'Arpit', 'Kunal', 'Manish'], 'StudentAge': [20, 20, 21, 22, 25], 'Marks': [80, 85, 90, 50, 60]}

In [17]:
student_info = pd.DataFrame(data)
student_info

  StudentName  StudentAge  Marks
0        Yash          20     80
1      Anagha          20     85
2       Arpit          21     90
3       Kunal          22     50
4      Manish          25     60

In [4]:
type(student_info)

pandas.core.frame.DataFrame

In [37]:
student_info["Remark"] = np.random.choice(["Good","bad"],5)

In [38]:
student_info

  StudentName  StudentAge  Marks Remark
0        Yash          20     80    bad
1      Anagha          20     85   Good
2       Arpit          21     90    bad
3       Kunal          22     50   Good
4      Manish          25     60   Good

In [42]:
student_info["ZerosCol"] = np.zeros(5,int)
student_info["OnesCol"] = np.ones(5,int)

In [43]:
student_info

  StudentName  StudentAge  Marks Remark  ZerosCol  OnesCol
0        Yash          20     80    bad         0        1
1      Anagha          20     85   Good         0        1
2       Arpit          21     90    bad         0        1
3       Kunal          22     50   Good         0        1
4      Manish          25     60   Good         0        1